# Data cleaning Pandas Assignment

In [18]:
import pandas as pd
import numpy as np

In [19]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [20]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [21]:
a=[]
for i in range(10045,10095,10):
    a.append(i)
series = pd.Series(a)
df['Flight_Number'] = series

In [22]:
df['From'] = df['From_To'].apply(lambda x: x.split('_')[0] )
df['To'] = df['From_To'].apply(lambda x: x.split('_')[1] )
df.drop(['From_To','FlightNumber'],axis=1,inplace=True)

In [23]:
df

   RecentDelays              Airline  Flight_Number      From         To
0      [23, 47]               KLM(!)          10045    LoNDon      paris
1            []    <Air France> (12)          10055    MAdrid      miLAN
2  [24, 43, 87]  (British Airways. )          10065    londON  StockhOlm
3          [13]       12. Air France          10075  Budapest      PaRis
4      [67, 32]          "Swiss Air"          10085  Brussels     londOn

In [24]:
df['From'] = df['From'].apply(lambda x : x.capitalize())
df['To'] = df['To'].apply(lambda x : x.capitalize())

In [25]:
df2 = df['RecentDelays'].apply(pd.Series)

df2.columns = ['delay_1','delay_2','delay_3']

In [26]:
def airline(string):
    final = ''.join(c for c in string if c.isalpha())
    return final

df['Airline'] = df['Airline'].apply(airline)

In [27]:
df

   RecentDelays         Airline  Flight_Number      From         To
0      [23, 47]             KLM          10045    London      Paris
1            []       AirFrance          10055    Madrid      Milan
2  [24, 43, 87]  BritishAirways          10065    London  Stockholm
3          [13]       AirFrance          10075  Budapest      Paris
4      [67, 32]        SwissAir          10085  Brussels     London

In [28]:
df = pd.concat([df,df2],axis=1)
df.drop('RecentDelays',axis=1,inplace=True)

In [29]:
df

,Airline,Flight_Number,From,To,delay_1,delay_2,delay_3
0,KLM,10045,London,Paris,23.0,47.0,NaN
1,AirFrance,10055,Madrid,Milan,NaN,NaN,NaN
2,BritishAirways,10065,London,Stockholm,24.0,43.0,87.0
3,AirFrance,10075,Budapest,Paris,13.0,NaN,NaN
4,SwissAir,10085,Brussels,London,67.0,32.0,NaN